server/libs/providers/FedEx/wsdl/TrackByNumber_Request.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v6="http://fedex.com/ws/track/v6">
<soapenv:Header/>
<soapenv:Body>
<v6:TrackRequest>
<v6:WebAuthenticationDetail>
<v6:UserCredential>
<v6:Key></v6:Key>
<v6:Password></v6:Password>
</v6:UserCredential>
</v6:WebAuthenticationDetail>
<v6:ClientDetail>
<v6:AccountNumber></v6:AccountNumber>
<v6:MeterNumber></v6:MeterNumber>
<v6:IntegratorId></v6:IntegratorId>  
<v6:Localization>
<v6:LanguageCode>EN</v6:LanguageCode>  
<v6:LocaleCode>US</v6:LocaleCode>
</v6:Localization>
</v6:ClientDetail>  
<v6:TransactionDetail>  
<v6:CustomerTransactionId>Track By Number</v6:CustomerTransactionId>  
<v6:Localization>
<v6:LanguageCode>EN</v6:LanguageCode>  
<v6:LocaleCode>US</v6:LocaleCode>
</v6:Localization>
</v6:TransactionDetail>
<v6:Version>
<v6:ServiceId>trck</v6:ServiceId>
<v6:Major>6</v6:Major>
<v6:Intermediate>0</v6:Intermediate>
<v6:Minor>0</v6:Minor>
</v6:Version>  
<v6:CarrierCode>FDXG</v6:CarrierCode> 
<v6:PackageIdentifier>
<v6:Value>400030715008165</v6:Value>
<v6:Type>TRACKING_NUMBER_OR_DOORTAG</v6:Type>
</v6:PackageIdentifier>
</v6:TrackRequest>
</soapenv:Body>
</soapenv:Envelope>